# Brewfile Personal
# https://github.com/Homebrew/homebrew-bundle

# Specify a directory to install
cask_args appdir: '/Applications'

# Taps
tap 'homebrew/cask-fonts'



# ---------------------------------------------------------------------
# Binaries
# ---------------------------------------------------------------------
brew 'angular-cli'
brew 'bash'
brew 'bash-completion'
brew 'diff-so-fancy' # diff-so-fancy (https://github.com/so-fancy/diff-so-fancy/)
brew 'ffmpeg'
brew 'glances' # Glances (https://nicolargo.github.io/glances/)
brew 'hub' # Hub (https://github.com/github/hub)
brew 'lazygit' # lazygit (https://github.com/jesseduffield/lazygit)
brew 'mas' # mas-cli (https://github.com/mas-cli/mas)
brew 'maven'
#brew 'mysql'
brew 'node' # Node (https://nodejs.org)
brew 'speedtest_cli'
#brew 'tomcat@9'
brew 'tree'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'



# ---------------------------------------------------------------------
# Apps
# ---------------------------------------------------------------------
cask '1password'
cask 'alfred'
cask 'anki'
cask 'appdelete'
#cask 'applepi-baker'
cask 'audio-hijack'
cask 'bartender'
cask 'brave-browser'
cask 'calibre'
cask 'colorpicker-skalacolor'
cask 'corretto'
cask 'coteditor'
cask 'couleurs'
cask 'dash'
cask 'datagrip'
cask 'docker'
cask 'drawio'
cask 'epic-games'
cask 'firefox'
cask 'fission'
cask 'handbrake'
cask 'iina'
cask 'imageoptim'
cask 'intellij-idea'
cask 'itsycal'
cask 'ivolume'
cask 'macmediakeyforwarder' # Mac Media Key Forwarder (https://github.com/milgra/macmediakeyforwarder)
cask 'metaz'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'onedrive'
cask 'openemu'
cask 'path-finder'
cask 'postman'
cask 'responsively'
cask 'scummvm'
#cask 'sdformatter'
cask 'sketch'
cask 'sourcetree'
cask 'spotify'
cask 'tor-browser'
cask 'transmission'
cask 'transmit'
cask 'virtualbox'
cask 'visual-studio-code'



# ---------------------------------------------------------------------
# Fonts
# ---------------------------------------------------------------------
cask 'font-courier-prime'
cask 'font-courier-prime-code'
cask 'font-courier-prime-sans'
cask 'font-fira-code'
cask 'font-hack'
cask 'font-juliamono'



# ---------------------------------------------------------------------
# Mac App Store
# ---------------------------------------------------------------------
mas 'Affinity Designer', id: 824171161
mas 'Affinity Photo', id: 824183456
mas 'Better', id: 1121192229
mas 'Debit & Credit', id: 882637653
mas 'Diptic', id: 526546615
mas 'Due', id: 524373870
mas 'GarageBand', id: 682658836
mas 'Glance', id: 1513574319
mas 'GoodNotes', id: 1444383602
mas 'iA Writer', id: 775737590
mas 'ifolor Designer', id: 446366603
mas 'iMovie', id: 408981434
mas 'Ka-Block!', id: 1335413823
mas 'Keynote', id: 409183694
mas 'Logic Pro X', id: 634148309
mas 'Lungo', id: 1263070803
mas 'Numbers', id: 409203825
mas 'Moom', id: 419330170
mas 'Pages', id: 409201541
mas 'Paprika Recipe Manager 3', id: 1303222628
mas 'Pixave', id: 924891282
mas 'Pixelmator Pro', id: 1289583905
mas 'Polarr Photo Editor Pro', id: 1058273036
mas 'Priime Styles', id: 1089627601
mas 'Reeder', id: 1449412482
mas 'SnapNDrag Pro', id: 430397512
mas 'Tagr', id: 903733783
mas 'Things', id: 904280696
mas 'Xcode', id: 497799835
mas 'xScope', id: 889428659