# Brewfile Personal
# https://github.com/Homebrew/homebrew-bundle

update
upgrade

# Specify a directory to install
cask_args appdir: '/Applications'

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'



# ---------------------------------------------------------------------
# Binaries
# ---------------------------------------------------------------------
brew 'bash'
brew 'bash-completion'
brew 'diff-so-fancy' # diff-so-fancy (https://github.com/so-fancy/diff-so-fancy/)
brew 'ffmpeg'
brew 'glances' # Glances (https://nicolargo.github.io/glances/)
brew 'hub' # Hub (https://github.com/github/hub)
brew 'lazygit' # lazygit (https://github.com/jesseduffield/lazygit)
brew 'mas' # mas-cli (https://github.com/mas-cli/mas)
brew 'node' # Node (https://nodejs.org)
brew 'speedtest_cli'
brew 'tree'
brew 'youtube-dl'



# ---------------------------------------------------------------------
# Apps
# ---------------------------------------------------------------------
cask '1password'
cask 'a-better-finder-rename'
cask 'alfred'
cask 'appdelete'
cask 'applepi-baker'
cask 'audio-hijack'
cask 'bartender'
cask 'boxer'
cask 'calibre'
cask 'colorpicker-skalacolor'
cask 'couleurs'
cask 'coteditor'
cask 'dash'
cask 'default-folder-x'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'fission'
cask 'flux'
cask 'fs-uae'
cask 'google-chrome'
cask 'handbrake'
cask 'iconjar'
cask 'imageoptim'
cask 'intellij-idea-ce'
cask 'itsycal'
cask 'ivolume'
cask 'jadengeller-helium'
cask 'kitematic'
cask 'logmein-client'
cask 'macmediakeyforwarder' # Mac Media Key Forwarder (https://github.com/milgra/macmediakeyforwarder)
cask 'marked'
cask 'metaz'
cask 'nordvpn'
cask 'openemu'
cask 'path-finder'
cask 'scummvm'
cask 'sdformatter'
cask 'slack'
cask 'sketch'
cask 'skype'
cask 'sourcetree'
cask 'spotify'
cask 'spotmenu'
cask 'sublime-text'
cask 'tor-browser'
cask 'transmission'
cask 'transmit'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'vuescan'
cask 'wwdc'



# ---------------------------------------------------------------------
# Fonts
# ---------------------------------------------------------------------
cask 'font-courier-prime '
cask 'font-courier-prime-code'
cask 'font-courier-prime-sans'
cask 'font-fira-code'
cask 'font-hack'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'



# ---------------------------------------------------------------------
# Quicklook
# ---------------------------------------------------------------------
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'



# ---------------------------------------------------------------------
# Mac App Store
# ---------------------------------------------------------------------
mas 'Affinity Designer', id: 824171161
mas 'Affinity Photo', id: 824183456
mas 'Better', id: 1121192229
mas 'Debit & Credit', id: 882637653
mas 'Diptic', id: 526546615
mas 'Due', id: 524373870
mas 'GarageBand', id: 682658836
mas 'iA Writer', id: 775737590
mas 'ifolor Designer', id: 446366603
mas 'Instant', id: 482262245
mas 'iMovie', id: 408981434
mas 'iStat Mini', id: 927292435
mas 'Ka-Block!', id: 1335413823
mas 'Keynote', id: 409183694
mas 'Logic Pro X', id: 634148309
mas 'Lungo', id: 1263070803
mas 'Numbers', id: 409203825
mas 'Moom', id: 419330170
mas 'Pages', id: 409201541
mas 'Paprika Recipe Manager 3', id: 1303222628
mas 'PDFify', id: 1435055351
mas 'Pixave', id: 924891282
mas 'Pixelmator Pro', id: 1289583905
mas 'Polarr Photo Editor Pro', id: 1058273036
mas 'Priime Styles', id: 1089627601
mas 'Reeder', id: 880001334
mas 'SnapNDrag Pro', id: 430397512
mas 'SQLPro for MSSQL', id: 828466809
mas 'Tagr', id: 903733783
mas 'Things3', id: 904280696
mas 'Tweetbot', id: 1384080005
mas 'xScope', id: 889428659



# ---------------------------------------------------------------------
# Cleanup
# ---------------------------------------------------------------------
cask alfred link
cleanup
cask cleanup